In [1]:
# Dependencies and Setup
from IPython.display import display,HTML
import pandas as pd
import numpy as np

from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
# Read CSV

#2014 UK
referrals_adult_df_2014_uk = pd.read_csv("uk-human-trafficking-data/2014_referrals_adult.csv")
referrals_all_df_2014_uk = pd.read_csv("uk-human-trafficking-data/2014_referrals_all.csv")
referrals_minor_df_2014_uk = pd.read_csv("uk-human-trafficking-data/2014_referrals_minor.csv")


referrals_minor_df_2014_uk.rename(columns={'Country of Origin':'nationality', 'Female':'female_minor', 'Male':'male_minor','Total':'total_minor'}, inplace=True)
referrals_minor_df_2014_uk_drop = referrals_minor_df_2014_uk.drop(['2013 - 2014 % Change'], axis=1)
referrals_minor_df_2014_uk_drop['year'] = 2014

referrals_adult_df_2014_uk.rename(columns={'Country of Origin':'nationality', 'Female':'female_adult', 'Male':'male_adult','Total':'total_adult'}, inplace=True)
referrals_adult_df_2014_uk_drop = referrals_adult_df_2014_uk.drop(['2013 - 2014 % Change', 'Transgender'], axis=1)
referrals_adult_df_2014_uk_drop['year'] = 2014

referrals_all_df_2014_uk.rename(columns={'Country of Origin':'nationality', 'Female':'female_all', 'Male':'male_all','Total':'total_all'}, inplace=True)
referrals_all_df_2014_uk_drop = referrals_all_df_2014_uk.drop(['2013 - 2014 % Change', 'Transgender'], axis=1)
referrals_all_df_2014_uk_drop['year'] = 2014

In [3]:
referrals_minor_df_2014_uk_drop.head()

      nationality  female_minor  male_minor  total_minor  year
0         Albania            34          83          117  2014
1         Vietnam            33          76          109  2014
2  United Kingdom            70           5           75  2014
3        Slovakia            42          30           72  2014
4         Nigeria            38          16           54  2014

In [4]:
referrals_adult_df_2014_uk_drop.head()

  nationality female_adult  male_adult total_adult  year
0     Albania          317          15         332  2014
1     Nigeria          166          24         190  2014
2     Romania           55          79         134  2014
3     Vietnam           43          64         107  2014
4      Poland           20          58          78  2014

In [5]:
referrals_all_df_2014_uk_drop.head()

  nationality female_all  male_all total_all  year
0     Albania        351        98       449  2014
1     Nigeria        204        40       244  2014
2     Vietnam         76       140       216  2014
3     Romania         68        83       151  2014
4    Slovakia         69        63       132  2014

In [6]:
rds_connection_string = "mysql://root:<password>@127.0.0.1/ETL_Traffic"
engine = create_engine(f'{rds_connection_string}')

In [7]:
engine.table_names()

['referrals_adult_df_2014',
 'referrals_adult_df_2014_uk',
 'referrals_all_df_2014',
 'referrals_all_df_2014_uk',
 'referrals_minor_df_2014']

In [8]:
referrals_minor_df_2014_uk_drop.to_sql(name='referrals_minor_df_2014', con=engine, if_exists='replace', index=False)

In [9]:
referrals_adult_df_2014_uk_drop.to_sql(name='referrals_adult_df_2014', con=engine, if_exists='replace', index=False)

In [10]:
referrals_all_df_2014_uk_drop.to_sql(name='referrals_all_df_2014', con=engine, if_exists='replace', index=False)

In [11]:
data = pd.read_sql("SELECT * FROM referrals_adult_df_2014 limit 5", engine)
data.head()

  nationality female_adult  male_adult total_adult  year
0     Albania          317          15         332  2014
1     Nigeria          166          24         190  2014
2     Romania           55          79         134  2014
3     Vietnam           43          64         107  2014
4      Poland           20          58          78  2014